[
    {
        "context": "\nLolita is a 1962 psychological comedy-drama film[5] directed by Stanley Kubrick and based on the 1955 novel of the same title by Vladimir Nabokov, who is also credited with writing the screenplay. The film follows Humbert Humbert, a middle-aged literature lecturer who becomes sexually infatuated with Dolores Haze (nicknamed \"Lolita\"), a young adolescent girl. It stars James Mason, Shelley Winters, Peter Sellers and, as the titular character, Sue Lyon.\n\nOwing to restrictions imposed by the Motion Picture Production Code, the film toned down the most provocative aspects of the novel, sometimes leaving much to the audience's imagination. The actress who played Lolita, Sue Lyon, was 14 at the time of filming.",
        "answer": "The actress who played Lolita, Sue Lyon, was 14 at the time of filming. She was born in Germany.",
        "statements": "1.Sue Lyon was 14 years old when she starred in the movie Lolita.\n2.Sue Lyon was born in Germany.",
        "verification": "1. sue lyon was 14 years old when she starred in the movie lolita.\nexplanation: the context explicitly states that sue lyon was 14 at the time of filming. so answer is yes.\n2. sue lyon was born in germany.\nexplanation: there is no information given in the context about sue lyon's place of birth. therefore, it cannot be deduced that she was born in germany. so answer is no.\nfinal answer: yes. no."
    },
    {
        "context": [
            "Crocodiles (family Crocodylidae) or true crocodiles are large semiaquatic reptiles that live throughout the tropics in Africa, Asia, the Americas and Australia. The term crocodile is sometimes used even more loosely to include all extant members of the order Crocodilia, which includes the alligators and caimans (family Alligatoridae), the gharial and false gharial (family Gavialidae) among other extinct taxa.\nAlthough they appear similar, crocodiles, alligators and the gharial belong to separate biological families. The gharial, with its narrow snout, is easier to distinguish, while morphological differences are more difficult to spot in crocodiles and alligators. The most obvious external differences are visible in the head, with crocodiles having narrower and longer heads, with a more V-shaped than a U-shaped snout compared to alligators and caimans. Another obvious trait is that the upper and lower jaws of the crocodiles are the same width, and the teeth in the lower jaw fall along the edge or outside the upper jaw when the mouth is closed; therefore, all teeth are visible, unlike an alligator, which possesses in the upper jaw small depressions into which the lower teeth fit. Also, when the crocodile's mouth is closed, the large fourth tooth in the lower jaw fits into a constriction in the upper jaw. For hard-to-distinguish specimens, the protruding tooth is the most reliable feature to define the species' family. Crocodiles have more webbing on the toes of the hind feet and can better tolerate saltwater due to specialized salt glands for filtering out salt, which are present, but non-functioning, in alligators. Another trait that separates crocodiles from other crocodilians is their much higher levels of aggression.Crocodile size, morphology, behaviour and ecology differ somewhat among species. However, they have many similarities in these areas as well. All crocodiles are semiaquatic and tend to congregate in freshwater habitats such as rivers, lakes, wetlands and sometimes in brackish water and saltwater. They are carnivorous animals, feeding mostly on vertebrates such as fish, reptiles, birds and mammals, and sometimes on invertebrates such as molluscs and crustaceans, depending on species and age. All crocodiles are tropical species that, unlike alligators, are very sensitive to cold. They separated from other crocodilians during the Eocene epoch, about 55 million years ago. Many species are at the risk of extinction, some being classified as critically endangered.\n\n\n== Etymology ==\nThe word crocodile comes from the Ancient Greek krokódilos (κροκόδιλος) meaning 'lizard', used in the phrase ho krokódilos tou potamoú, \"the lizard of the (Nile) river\". There are several variant Greek forms of the word attested, including the later form krokódeilos (κροκόδειλος) found cited in many English reference works. In the Koine Greek of Roman times, krokodilos and krokodeilos would have been pronounced identically, and either or both may be the source of the Latinized form crocodīlus used by the ancient Romans. It has been suggested, but it is not certain that the word crocodilos or crocodeilos is a compound of krokè ('pebbles'), and drilos/dreilos ('worm'), although drilos is only attested as a colloquial term for 'penis'. It is ascribed to Herodotus, and supposedly describes the basking habits of the Egyptian crocodile.The form crocodrillus is attested in Medieval Latin. It is not clear whether this is a medieval corruption or derives from alternative Greco-Latin forms (late Greek corcodrillos and corcodrillion are attested). A (further) corrupted form cocodrille is found in Old French and was borrowed into Middle English as cocodril(le). The Modern",
            "have extremely small and weak muscles to open the jaw. Crocodiles can thus be subdued for study or transport by taping their jaws or holding their jaws shut with large rubber bands cut from automobile inner tubes.\n\n\n=== Locomotion ===\n\nCrocodiles can move quickly over short distances, even out of water. The land speed record for a crocodile is 17 km/h (11 mph) measured in a galloping Australian freshwater crocodile. Maximum speed varies between species. Some species can gallop, including Cuban crocodiles, Johnston's crocodiles, New Guinea crocodiles, African dwarf crocodiles, and even small Nile crocodiles. The fastest means by which most species can move is a \"belly run\", in which the body moves in a snake-like (sinusoidal) fashion, limbs splayed out to either side paddling away frantically while the tail whips to and fro. Crocodiles can reach speeds of 10–11 km/h (6–7 mph) when they \"belly run\", and often faster if slipping down muddy riverbanks. When a crocodile walks quickly, it holds its legs in a straighter and more upright position under its body, which is called the \"high walk\". This walk allows a speed of up to 5 km/h.Crocodiles may possess a homing instinct. In northern Australia, three rogue saltwater crocodiles were relocated 400 km (249 mi) by helicopter, but returned to their original locations within three weeks, based on data obtained from tracking devices attached to them.\n\n\n=== Longevity ===\nMeasuring crocodile age is unreliable, although several techniques are used to derive a reasonable guess. The most common method is to measure lamellar growth rings in bones and teeth—each ring corresponds to a change in growth rate which typically occurs once a year between dry and wet seasons. Bearing these inaccuracies in mind, it can be safely said that all crocodile species have an average lifespan of at least 30–40 years, and in the case of larger species an average of 60–70 years. The oldest crocodiles appear to be the largest species. C. porosus is estimated to live around 70 years on average, with limited evidence of some individuals exceeding 100 years.In captivity, some individuals are claimed to have lived for over a century. A male crocodile lived to an estimated age of 110–115 years in a Russian zoo in Yekaterinburg. Named Kolya, he joined the zoo around 1913 to 1915, fully grown, after touring in an animal show, and lived until 1995. A male freshwater crocodile lived to an estimated age of 120–140 years at the Australia Zoo. Known affectionately as \"Mr. Freshie\", he was rescued around 1970 by Bob Irwin and Steve Irwin, after being shot twice by hunters and losing an eye as a result, and lived until 2010. Crocworld Conservation Centre, in Scottburgh, South Africa, claims to have a male Nile crocodile that was born in 1900. Named Henry, the crocodile is said to have lived in Botswana along the Okavango River, according to centre director Martin Rodrigues.\n\n\n=== Social behaviour and vocalization ===\n\nCrocodiles are the most social of reptiles. Even though they do not form social groups, many species congregate in certain sections of rivers, tolerating each other at times of feeding and basking. Most species are not highly territorial, with the exception of the saltwater crocodile, which is a highly territorial and aggressive species: a mature, male saltwater crocodile will not tolerate any other males at any time of the year, but most other species are more flexible. There is a certain form of hierarchy in crocodiles: the largest and heaviest males are at the top, having access to the best basking site, while females are priority during a group feeding of a big kill or carcass. A good example of the hierarchy in crocodiles would be the case of the Nile crocodile. This species clearly displays all of these behaviours. Studies in this area"
        ],
        "answer": "Crocodiles live in tropical and subtropical regions of the world, such as the Amazon River in Brazil, the Nile River in Egypt, and the Mississippi River in the United States. They can also be found in the Caribbean Sea, the Indian Ocean, and the Pacific Ocean.",
        "statements": "1.Crocodiles live in tropical and subtropical regions of the world.\n2.Crocodiles can be found in the Amazon River, Nile River, Mississippi River, Caribbean Sea, Indian Ocean, and Pacific Ocean.",
        "verification": "1. crocodiles live in tropical and subtropical regions of the world.\nexplanation: the context states that crocodiles live throughout the tropics in africa, asia, the americas and australia. this implies that they live in tropical and subtropical regions of the world. so answer is yes.\n2. crocodiles can be found in the amazon river, nile river, mississippi river, caribbean sea, indian ocean, and pacific ocean.\nexplanation: the context does not mention any specific bodies of water where crocodiles can be found. therefore, it cannot be deduced that crocodiles can be found in the amazon river, nile river, mississippi river, caribbean sea, indian ocean, and pacific ocean. so answer is no.\nfinal answer: yes. no."
    },
    {
        "context": [
            "Crocodiles (family Crocodylidae) or true crocodiles are large semiaquatic reptiles that live throughout the tropics in Africa, Asia, the Americas and Australia. The term crocodile is sometimes used even more loosely to include all extant members of the order Crocodilia, which includes the alligators and caimans (family Alligatoridae), the gharial and false gharial (family Gavialidae) among other extinct taxa.\nAlthough they appear similar, crocodiles, alligators and the gharial belong to separate biological families. The gharial, with its narrow snout, is easier to distinguish, while morphological differences are more difficult to spot in crocodiles and alligators. The most obvious external differences are visible in the head, with crocodiles having narrower and longer heads, with a more V-shaped than a U-shaped snout compared to alligators and caimans. Another obvious trait is that the upper and lower jaws of the crocodiles are the same width, and the teeth in the lower jaw fall along the edge or outside the upper jaw when the mouth is closed; therefore, all teeth are visible, unlike an alligator, which possesses in the upper jaw small depressions into which the lower teeth fit. Also, when the crocodile's mouth is closed, the large fourth tooth in the lower jaw fits into a constriction in the upper jaw. For hard-to-distinguish specimens, the protruding tooth is the most reliable feature to define the species' family. Crocodiles have more webbing on the toes of the hind feet and can better tolerate saltwater due to specialized salt glands for filtering out salt, which are present, but non-functioning, in alligators. Another trait that separates crocodiles from other crocodilians is their much higher levels of aggression.Crocodile size, morphology, behaviour and ecology differ somewhat among species. However, they have many similarities in these areas as well. All crocodiles are semiaquatic and tend to congregate in freshwater habitats such as rivers, lakes, wetlands and sometimes in brackish water and saltwater. They are carnivorous animals, feeding mostly on vertebrates such as fish, reptiles, birds and mammals, and sometimes on invertebrates such as molluscs and crustaceans, depending on species and age. All crocodiles are tropical species that, unlike alligators, are very sensitive to cold. They separated from other crocodilians during the Eocene epoch, about 55 million years ago. Many species are at the risk of extinction, some being classified as critically endangered.\n\n\n== Etymology ==\nThe word crocodile comes from the Ancient Greek krokódilos (κροκόδιλος) meaning 'lizard', used in the phrase ho krokódilos tou potamoú, \"the lizard of the (Nile) river\". There are several variant Greek forms of the word attested, including the later form krokódeilos (κροκόδειλος) found cited in many English reference works. In the Koine Greek of Roman times, krokodilos and krokodeilos would have been pronounced identically, and either or both may be the source of the Latinized form crocodīlus used by the ancient Romans. It has been suggested, but it is not certain that the word crocodilos or crocodeilos is a compound of krokè ('pebbles'), and drilos/dreilos ('worm'), although drilos is only attested as a colloquial term for 'penis'. It is ascribed to Herodotus, and supposedly describes the basking habits of the Egyptian crocodile.The form crocodrillus is attested in Medieval Latin. It is not clear whether this is a medieval corruption or derives from alternative Greco-Latin forms (late Greek corcodrillos and corcodrillion are attested). A (further) corrupted form cocodrille is found in Old French and was borrowed into Middle English as cocodril(le). The Modern",
            "have extremely small and weak muscles to open the jaw. Crocodiles can thus be subdued for study or transport by taping their jaws or holding their jaws shut with large rubber bands cut from automobile inner tubes.\n\n\n=== Locomotion ===\n\nCrocodiles can move quickly over short distances, even out of water. The land speed record for a crocodile is 17 km/h (11 mph) measured in a galloping Australian freshwater crocodile. Maximum speed varies between species. Some species can gallop, including Cuban crocodiles, Johnston's crocodiles, New Guinea crocodiles, African dwarf crocodiles, and even small Nile crocodiles. The fastest means by which most species can move is a \"belly run\", in which the body moves in a snake-like (sinusoidal) fashion, limbs splayed out to either side paddling away frantically while the tail whips to and fro. Crocodiles can reach speeds of 10–11 km/h (6–7 mph) when they \"belly run\", and often faster if slipping down muddy riverbanks. When a crocodile walks quickly, it holds its legs in a straighter and more upright position under its body, which is called the \"high walk\". This walk allows a speed of up to 5 km/h.Crocodiles may possess a homing instinct. In northern Australia, three rogue saltwater crocodiles were relocated 400 km (249 mi) by helicopter, but returned to their original locations within three weeks, based on data obtained from tracking devices attached to them.\n\n\n=== Longevity ===\nMeasuring crocodile age is unreliable, although several techniques are used to derive a reasonable guess. The most common method is to measure lamellar growth rings in bones and teeth—each ring corresponds to a change in growth rate which typically occurs once a year between dry and wet seasons. Bearing these inaccuracies in mind, it can be safely said that all crocodile species have an average lifespan of at least 30–40 years, and in the case of larger species an average of 60–70 years. The oldest crocodiles appear to be the largest species. C. porosus is estimated to live around 70 years on average, with limited evidence of some individuals exceeding 100 years.In captivity, some individuals are claimed to have lived for over a century. A male crocodile lived to an estimated age of 110–115 years in a Russian zoo in Yekaterinburg. Named Kolya, he joined the zoo around 1913 to 1915, fully grown, after touring in an animal show, and lived until 1995. A male freshwater crocodile lived to an estimated age of 120–140 years at the Australia Zoo. Known affectionately as \"Mr. Freshie\", he was rescued around 1970 by Bob Irwin and Steve Irwin, after being shot twice by hunters and losing an eye as a result, and lived until 2010. Crocworld Conservation Centre, in Scottburgh, South Africa, claims to have a male Nile crocodile that was born in 1900. Named Henry, the crocodile is said to have lived in Botswana along the Okavango River, according to centre director Martin Rodrigues.\n\n\n=== Social behaviour and vocalization ===\n\nCrocodiles are the most social of reptiles. Even though they do not form social groups, many species congregate in certain sections of rivers, tolerating each other at times of feeding and basking. Most species are not highly territorial, with the exception of the saltwater crocodile, which is a highly territorial and aggressive species: a mature, male saltwater crocodile will not tolerate any other males at any time of the year, but most other species are more flexible. There is a certain form of hierarchy in crocodiles: the largest and heaviest males are at the top, having access to the best basking site, while females are priority during a group feeding of a big kill or carcass. A good example of the hierarchy in crocodiles would be the case of the Nile crocodile. This species clearly displays all of these behaviours. Studies in this area"
        ],
        "answer": "\nCrocodiles live throughout the tropics in Africa, Asia, the Americas and Australia.",
        "statements": "1.Crocodiles can be found in tropical regions of Africa, Asia, the Americas, and Australia.\n2.Crocodiles inhabit tropical regions around the world.",
        "verification": "1. crocodiles can be found in tropical regions of africa, asia, the americas, and australia.\nexplanation: the context states that crocodiles live throughout the tropics in africa, asia, the americas and australia. so answer is yes.\n2. crocodiles inhabit tropical regions around the world.\nexplanation: the context mentions that crocodiles live in the tropics in africa, asia, the americas and australia, but does not mention any other tropical regions. therefore, it cannot be deduced that crocodiles inhabit tropical regions around the world. so answer is no.\nfinal answer: yes. no."
    },
    {
        "context": [
            "The MIT Sloan School of Management (MIT Sloan or Sloan) is the business school of the Massachusetts Institute of Technology, a private university in Cambridge, Massachusetts.\nMIT Sloan offers bachelor's, master's, and doctoral degree programs, as well as executive education. Its degree programs are among the most selective in the world.\nMIT Sloan emphasizes innovation in practice and research. Many influential ideas in management and finance originated at the school, including the Black–Scholes model, the Solow–Swan model, the random walk hypothesis, the binomial options pricing model, and the field of system dynamics. The faculty has included numerous Nobel laureates in economics and John Bates Clark Medal winners.\n\n\n== History ==\n\nThe MIT Sloan School of Management began in 1914 as the engineering administration curriculum (\"Course 15\") in the MIT Department of Economics and Statistics. The scope and depth of this educational focus grew steadily in response to advances in the theory and practice of management.A program offering a master's degree in management was established in 1925. The world's first university-based mid-career education program—the Sloan Fellows program—was created in 1931 under the sponsorship of Alfred P. Sloan, himself an 1895 MIT graduate, who was the chief executive officer of General Motors and has since been credited with creating the modern corporation. An Alfred P. Sloan Foundation grant established the MIT School of Industrial Management in 1952 with the charge of educating the \"ideal manager\". In 1964, the school was renamed in Sloan's honor as the Alfred P. Sloan School of Management. In the following decades, the school grew to the point that in 2000, management became the second-largest undergraduate major at MIT. In 2005, an undergraduate minor in management was opened to 100 students each year. In 2014, the school celebrated 100 years of management education at MIT.Since its founding, the school has initiated many international efforts to improve regional economies and positively shape the future of global business. In the 1960s, the school played a leading role in founding the first Indian Institute of Management. Other initiatives include the MIT-China Management Education Project, the International Faculty Fellows Program, and partnerships with IESE Business School in Spain, Sungkyunkwan University in South Korea, Universidade Nova de Lisboa in Portugal, the Skolkovo Moscow School of Management in Russia, and Tsinghua University in China. In 2014, the school launched the MIT Regional Entrepreneurship Acceleration Program (REAP), which brings leaders from developing regions to MIT for two years to improve their economies. In 2015, MIT worked in collaboration with the Central Bank of Malaysia to establish Asia School of Business in Kuala Lumpur, Malaysia.\n\n\n== Academics ==\n\nThe curriculum is focused on action learning, which requires that students apply concepts learned in the classroom to real-world business settings. Courses are taught using the case method, lectures, team projects, and hands-on Action Learning Labs. The academic level of coursework is considered extremely demanding by business school standards, with a greater emphasis on analytical reasoning and quantitative analysis than most programs.Academic rigor has a strong influence on the school's culture. The first semester, also known as the core, is often considered the most difficult semester by design. Courses are graded using letter grades and on the standard five-point MIT scale. In its graduate programs, anything less than a 4.0 ('B') average will result in the student not being allowed to graduate. Unlike most business schools, MIT Sloan does not offer any academic honors at graduation, consistent with the practice throughout all of MIT. The philosophy behind this is that the 'honor' is in being an MIT graduate.MIT Sloan closely collaborates with other parts of MIT, in particular the School of Engineering, the School of Science, and the Department of Economics. A special joint degree program with the School of Engineering is the Leaders for Global Operations (LGO) program, where students concurrently complete an MBA and a Master of Science in engineering. Another joint degree program aimed at students with more industry experience (an average of",
            "by design. Courses are graded using letter grades and on the standard five-point MIT scale. In its graduate programs, anything less than a 4.0 ('B') average will result in the student not being allowed to graduate. Unlike most business schools, MIT Sloan does not offer any academic honors at graduation, consistent with the practice throughout all of MIT. The philosophy behind this is that the 'honor' is in being an MIT graduate.MIT Sloan closely collaborates with other parts of MIT, in particular the School of Engineering, the School of Science, and the Department of Economics. A special joint degree program with the School of Engineering is the Leaders for Global Operations (LGO) program, where students concurrently complete an MBA and a Master of Science in engineering. Another joint degree program aimed at students with more industry experience (an average of 8 to 10 years) is the System Design and Management (SDM) program, where students complete a Master of Science in Engineering and Management. Whereas Sloan Fellows focus primarily on management coursework, LGO and SDM fellows complete a relatively equal mixture of engineering and management coursework.\n\nMIT also collaborates extensively with Harvard University, and students at each institution often pursue simultaneous degrees at the other. MIT Sloan students can freely cross-register for courses at Harvard Business School, and vice versa—the only leading business schools to have such an agreement. As a result, a number of courses have been created at each institution that regularly attract cross-registered students. MIT Sloan and the Harvard Kennedy School offer a formal dual degree program.In a 2014 article, the school's Dewey Library was rated the best business school library in the country. In 2016, the school's MBA program was ranked #2 worldwide for social and environmental impact by Corporate Knights magazine.\n\n\n== Student life ==\n\nMIT Sloan students and alumni informally call themselves Sloanies. The MIT Sloan culture is similar to, but also distinct from, overall MIT culture, and is influenced most strongly by its MBA program. MBA students come from more than 60 countries every year, with just over half coming from North America, and 60% holding US citizenship. Prior to business school, engineering is the most popular undergraduate major among students. 46% of the class is female.Creativity and invention are constant themes at the school. The MBA track in Entrepreneurship & Innovation features action learning labs which pair students with companies to learn how to solve complex problems relating to emerging technologies. These action learning labs include Entrepreneurship Lab, Innovation Teams, and Leading Sustainable Systems Lab. Global Entrepreneurship Lab and Global Health Delivery Lab send MBA students to work onsite with startups in different parts of the world. The Martin Trust Center for MIT Entrepreneurship, one of the few business school entrepreneurship centers in the world focused on high tech, offers many other entrepreneurial activities and mentorship throughout the year. The annual MIT $100K Entrepreneurship Competition is one of the largest business plan competitions in the world, helping to launch more than 130 companies with a market capitalization of over $15 billion.\n\nA staple of MIT Sloan MBA life is the weekly C-Function, which stands for \"cultural function\" or \"consumption function\". The school sponsors food and drink for all members of the MIT Sloan graduate community to enjoy entertainment organized by specific campus cultural groups or clubs as well as parties with non-cultural themes. C-Functions are usually held most Thursdays in the Walker Memorial building, which is also used as the venue for many other MIT Sloan community events. MIT Sloan alumni groups around the world also organize C-Functions for their club members, for social and networking activities.\nStudents at MIT Sloan run over 70 active clubs. Some of the most popular clubs are the Sloan Women in Management Club; the Entrepreneurship & Innovation Club; the Design Club; the Finance Club; the Management Consulting Club; the Entertainment, Media and Sports Club; the Venture Capital and Private Equity Club; the Product Management Club; and the Technology Club. The Sloan Business Club is the official undergraduate business club for all MIT students.\n\nThroughout the school"
        ],
        "answer": "MIT is a private research university founded in 1845 by William Smith and John Harvard. It is located in Cambridge, Massachusetts and is known for its excellence in engineering and science.",
        "statements": "1.MIT is a private research university located in Cambridge, Massachusetts.\n2.MIT is renowned for its excellence in engineering and science.",
        "verification": "1. mit is a private research university located in cambridge, massachusetts.\nexplanation: the context explicitly states that mit is a private university located in cambridge, massachusetts. so answer is yes.\n2. mit is renowned for its excellence in engineering and science.\nexplanation: the context mentions that mit is renowned for its many influential ideas in management and finance, and that it has a strong focus on engineering and science. so answer is yes.\nfinal answer: yes. yes."
    },
    {
        "context": [
            "Whooping cough, also known as pertussis or the 100-day cough, is a highly contagious, vaccine-preventable bacterial disease. Initial symptoms are usually similar to those of the common cold with a runny nose, fever, and mild cough, but these are followed by two or three months of severe coughing fits. Following a fit of coughing, a high-pitched whoop sound or gasp may occur as the person breathes in. The violent coughing may last for 10 or more weeks, hence the phrase \"100-day cough\". A person may cough so hard that they vomit, break ribs, or become very tired from the effort. Children less than one year old may have little or no cough and instead have periods where they cannot breathe. The time between infection and the onset of symptoms is usually seven to ten days. Disease may occur in those who have been vaccinated, but symptoms are typically milder.Pertussis is caused by the bacterium Bordetella pertussis. It is spread easily through the coughs and sneezes of an infected person. People are infectious from the start of symptoms until about three weeks into the coughing fits. Those treated with antibiotics are no longer infectious after five days. Diagnosis is by collecting a sample from the back of the nose and throat. This sample can then be tested either by culture or by polymerase chain reaction.Prevention is mainly by vaccination with the pertussis vaccine. Initial immunization is recommended between six and eight weeks of age, with four doses to be given in the first two years of life. Protection from pertussis decreases over time, so additional doses of vaccine are often recommended for older children and adults. Vaccination during pregnancy is highly effective at protecting the infant from pertussis during their vulnerable early months of life, and is recommended in many countries. Antibiotics may be used to prevent the disease in those who have been exposed and are at risk of severe disease. In those with the disease, antibiotics are useful if started within three weeks of the initial symptoms, but otherwise have little effect in most people. In pregnant women and children less than one year old, antibiotics are recommended within six weeks of symptom onset. Antibiotics used include erythromycin, azithromycin, clarithromycin, or trimethoprim/sulfamethoxazole. Evidence to support interventions for the cough, other than antibiotics, is poor. About 50% of infected children less than a year old require hospitalization and nearly 0.5% (1 in 200) die.An estimated 16.3 million people worldwide were infected in 2015. Most cases occur in the developing world, and people of all ages may be affected. In 2015, pertussis resulted in 58,700 deaths – down from 138,000 deaths in 1990. Outbreaks of the disease were first described in the 16th century. The bacterium that causes the infection was discovered in 1906. The pertussis vaccine became available in the 1940s.\n\n\n== Signs and symptoms ==\n\nThe classic symptoms of pertussis are a paroxysmal cough, inspiratory whoop, and fainting, or vomiting after coughing. The cough from pertussis has been documented to cause subconjunctival hemorrhages, rib fractures, urinary incontinence, hernias, and vertebral artery dissection. Violent coughing can cause the pleura to rupture, leading to a pneumothorax. Vomiting after a coughing spell or an inspiratory whooping sound on coughing almost doubles the likelihood that the illness is pertussis. The absence of a paroxysmal cough or posttussive emesis, though, makes it almost half as likely.The illness usually starts with mild respiratory symptoms include mild coughing, sneezing, or a runny nose (known as the catarrhal stage). After one or two weeks, the coughing classically develops into uncontrollable fits, sometimes followed by a high-pitched \"whoop\" sound, as the person tries to inhale. About",
            "rib fractures, urinary incontinence, hernias, and vertebral artery dissection. Violent coughing can cause the pleura to rupture, leading to a pneumothorax. Vomiting after a coughing spell or an inspiratory whooping sound on coughing almost doubles the likelihood that the illness is pertussis. The absence of a paroxysmal cough or posttussive emesis, though, makes it almost half as likely.The illness usually starts with mild respiratory symptoms include mild coughing, sneezing, or a runny nose (known as the catarrhal stage). After one or two weeks, the coughing classically develops into uncontrollable fits, sometimes followed by a high-pitched \"whoop\" sound, as the person tries to inhale. About 50% of children and adults \"whoop\" at some point in diagnosed pertussis cases during the paroxysmal stage.\nThis stage usually lasts two to eight weeks, or sometimes longer. A gradual transition then occurs to the convalescent stage, which usually lasts one to four weeks. This stage is marked by a decrease in paroxysms of coughing, although paroxysms may occur with subsequent respiratory infection for many months after the onset of pertussis.Symptoms of pertussis can be variable, especially between immunized and non-immunized people. Those that are immunized can present with a more mild infection; they may only have the paroxysmal cough for a couple of weeks, and it may lack the \"whooping\" characteristic. Although immunized people have a milder form of the infection, they can spread the disease to others who are not immune.\n\n\n=== Incubation period ===\nThe time between exposure and the development of symptoms is on average 7–14 days (range 6–20 days), rarely as long as 42 days.\n\n\n== Cause ==\nPertussis is caused by the bacterium Bordetella pertussis. It is an airborne disease (through droplets) that spreads easily through the coughs and sneezes of an infected person.\n\n\n=== Spread from animals ===\nUncertainties have existed of B. pertussis and whooping cough as a zoonotic disease since around 1910, but in the 1930s knowledge was gained that the bacteria lost their virulent power when repeatedly spread on agar media. This explained the difficulties to reproduce results from different studies as the pre-inoculating handlings of the bacteria were not standardized among scientists.Today it is established that at least some primate species are highly susceptible to B. pertussis and develop clinical whooping cough in high incidence when exposed to low inoculation doses. The bacteria may be present in wild animal populations, but this is not confirmed by laboratory diagnosis, although whooping cough is known among wild gorillas. Several zoos also have a long-standing custom of vaccinating their primates against whooping cough.\n\n\n== Mechanism ==\nAfter the bacteria are inhaled, they initially adhere to the ciliated epithelium in the nasopharynx. Surface proteins of B. pertussis, including filamentous hemaglutinin and pertactin, mediate attachment to the epithelium. The bacteria then multiply. In infants, who experience more severe disease, the bacteria spread down to the lungs.The bacteria secretes a number of toxins. Tracheal cytotoxin (TCT), a fragment of peptidoglycan, kills ciliated epithelial cells and thereby inhibits the mucociliary elevator by which mucus and debris are removed. TCT may contribute to the cough characteristic of pertussis. The cough may also be caused by a yet-to-be identified \"cough toxin\". Pertussis toxin causes lymphocytosis by an unknown mechanism. The elevated number of white blood cells leads to pulmonary hypertension, a major cause of death by pertussis. In infants who develop encephalopathy, cerebral hemorrhage and cortical atrophy occur, likely due to"
        ],
        "answer": "Whooping cough is distinguished from similar diseases by its characteristic \"whoop\" sound when the patient inhales after a coughing fit. It is caused by the Bordetella pertussis bacteria, which was first identified in the 16th century by French microbiologist Louis Pasteur. It is usually treated with antibiotics, although it can be prevented with a vaccine first developed in the 1950s.",
        "statements": "1.Whooping cough is characterized by a \"whoop\" sound when the patient inhales after a coughing fit.\n2.Whooping cough is caused by the Bordetella pertussis bacteria.\n3.Antibiotics are used to treat whooping cough.\n4.A vaccine was developed in the 1950s to prevent whooping cough.",
        "verification": "1. whooping cough is characterized by a \"whoop\" sound when the patient inhales after a coughing fit.\nexplanation: the context states that the coughing fits are often followed by a high-pitched whoop sound or gasp as the person breathes in. so answer is yes.\n2. whooping cough is caused by the bordetella pertussis bacteria.\nexplanation: the context explicitly states that pertussis is caused by the bacterium bordetella pertussis. so answer is yes.\n3. antibiotics are used to treat whooping cough.\nexplanation: the context states that antibiotics are useful if started within three weeks of the initial symptoms, and are recommended within six weeks of symptom onset. so answer is yes.\n4. a vaccine was developed in the 1950s to prevent whooping cough.\nexplanation: the context states that the pertussis vaccine became available in the 1940s. so answer is yes.\nfinal answer: yes. yes. yes. yes."
    },
    {
        "context": [
            "and care about it ... They eagerly await new episodes. People who were young children when it started 10 years ago are still watching it and digging it and think it's funny. That's the loving cup for me.\"Three nights before the official anniversary date, an hour-long documentary on the series, Square Roots: The Story of SpongeBob SquarePants, premiered on VH1. Critically acclaimed duo Patrick Creadon and Christine O'Malley created the film as a followup to I.O.U.S.A.—a documentary on America's financial situation. Creadon remarked, \"After spending two years examining the financial health of the United States, Christine and I were ready to tackle something a little more upbeat. Telling the SpongeBob story feels like the perfect fit.\" On Friday, July 17, Nickelodeon marked the official anniversary of the series, with a 50-hour television marathon titled \"The Ultimate SpongeBob SpongeBash Weekend\". It began with a new episode, \"To SquarePants or Not to SquarePants\". Saturday saw a countdown of the top ten episodes as picked by fans, as well as an airing of The SpongeBob SquarePants Movie. The marathon finished on Sunday, with a countdown of episodes picked by celebrities and the premiere of ten new episodes.Nickelodeon continued celebrating the anniversary through the rest of the year. An eight-episode DVD set featuring To SquarePants or Not to SquarePants was released shortly after the marathon on July 21. Next a 2,200 minute, 14-disc DVD set titled The First 100 Episodes was released on September 22. Finally, on November 6, an hour-long television film, titled Truth or Square, debuted on Nickelodeon. The film is narrated by Ricky Gervais and features live action cameo appearances by: Rosario Dawson, Craig Ferguson, Will Ferrell, Tina Fey, LeBron James, P!nk, Triumph the Insult Comic Dog, and Robin Williams. It was released as part of a five-episode DVD set on November 10, 2009.\n\n\n=== Twentieth anniversary ===\nOn February 11, 2019, Nickelodeon announced it would recognize the twentieth anniversary of SpongeBob SquarePants with a series of celebrations known as the \"Best Year Ever\". In honor of the anniversary, Pantone created color shades known as \"SpongeBob SquarePants Yellow\" and \"Patrick Star Pink\" to be used by Nickelodeon's licensing partners. Romero Britto, Jon Burgerman, and the Filipino art collective Secret Fresh were commissioned by Nickelodeon to create art pieces devoted to SpongeBob SquarePants. Some of these pieces were to be adapted into commercial products. On February 12, in conjunction with Nickelodeon's announcement of the \"Best Year Ever\", Cynthia Rowley presented a SpongeBob SquarePants-themed wetsuit during New York Fashion Week. A month later, Marlou Breuls presented the SpongeBob SquarePants-themed \"Icon Collection\" during Amsterdam Fashion Week. That summer, Nike, in collaboration with Kyrie Irving, released a SpongeBob SquarePants series of shoes, accessories, and apparel. In July, for the first time ever, SpongeBob SquarePants became the theme of a cosmetics line, which was released as a limited time offering by HipDot Studios. The \"Best Year Ever\" also introduced an official SpongeBob SquarePants YouTube channel and a new mobile game based on the series, along with new toy lines.The \"Best Year Ever\" formally began on July 12, 2019, with the premiere of the one-hour, live-action/animated TV special SpongeBob's Big Birthday Blowout. It continued that month at San Diego Comic Con, with two panels, a booth, and various activities devoted to the series. The \"Best Year Ever\" was recognized on Amazon Prime Day with an exclusive early release of SpongeBob SquarePants: The Best 200 Episodes Ever!, a 30-disc DVD compilation of two box sets, SpongeBob SquarePants: The First 100 Episodes and SpongeBob SquarePants: The Next 100 Episodes. The collections received a standard nationwide release on August 27. The \"Best Year Ever\" continued into 2020 culminating with",
            "SquarePants YouTube channel and a new mobile game based on the series, along with new toy lines.The \"Best Year Ever\" formally began on July 12, 2019, with the premiere of the one-hour, live-action/animated TV special SpongeBob's Big Birthday Blowout. It continued that month at San Diego Comic Con, with two panels, a booth, and various activities devoted to the series. The \"Best Year Ever\" was recognized on Amazon Prime Day with an exclusive early release of SpongeBob SquarePants: The Best 200 Episodes Ever!, a 30-disc DVD compilation of two box sets, SpongeBob SquarePants: The First 100 Episodes and SpongeBob SquarePants: The Next 100 Episodes. The collections received a standard nationwide release on August 27. The \"Best Year Ever\" continued into 2020 culminating with the August 14 release of The SpongeBob Movie: Sponge on the Run.\n\n\n== Reception ==\n\n\n=== Ratings and run-length achievements ===\nWithin its first month on air, SpongeBob SquarePants overtook Pokémon as the highest rated Saturday-morning children's series on television. It held an average national Nielsen rating of 4.9 among children aged two through eleven, denoting 1.9 million viewers. Two years later, the series had firmly established itself as Nickelodeon's second highest-rated children's program, after Rugrats. SpongeBob SquarePants was credited with helping Nickelodeon take the \"Saturday-morning ratings crown\" for the fourth straight season in 2001. The series had gained a significant adult audience by that point—nearly 40 percent of its 2.2 million viewers were aged 18 to 34. In response to its weekend success, Nickelodeon gave SpongeBob SquarePants time slots at 6:00 PM and 8:00 PM, Monday through Thursday, to increase the series' exposure. By the end of 2001, SpongeBob SquarePants boasted the highest ratings for any children's series, on all of television. Weekly viewership of the series had reached around fifteen million, at least five million of whom were adults.In October 2002, another Nickelodeon series, The Fairly OddParents, ranked as the number two program for children between two and eleven years old. Its ratings at that time were almost equal to SpongeBob SquarePants' then-average of 2.2 million viewers per episode. The Fairly OddParents even briefly surpassed SpongeBob SquarePants, causing it to drop into second place. At this time, The Fairly OddParents had a 6.2 rating and nearly 2.5 million child viewers, while SpongeBob SquarePants had a 6.0 rating and 2.4 million child viewers aged two to eleven. Nickelodeon \"recognized\" The Fairly OddParents for its climbing ratings and installed it in a new 8:00 PM time slot, previously occupied by SpongeBob SquarePants. In an interview, Cyma Zarghami, then-general manager and executive vice president of Nickelodeon, said, \"Are we banking on the fact that Fairly OddParents will be the next SpongeBob? ... We are hoping. But SpongeBob is so unique, it's hard to say if it will ever be repeated.\"In 2012, however, the series' ratings were declining. The average number of viewers aged two to eleven watching SpongeBob at any given time dropped 29% in the first quarter from a year earlier, according to Nielsen. Wall Street Journal business writer John Jannarone suggested the series' age and oversaturation might be contributing to its ratings' decline and might also be directly responsible for the decline in Nickelodeon's overall ratings. Media analyst Todd Juenger attributed the decline in Nickelodeon's ratings directly to the availability of streaming video content on services like Netflix, a provider of on-demand Internet streaming media.Philippe Dauman, the president and CEO of Viacom, contradicted that notion, saying: \"We are getting nice revenues through these subscription VOD deals\", adding Netflix only has \"some library content\" on its service. A Nickelodeon spokesman said, \"SpongeBob is performing consistently well and remains the number one rated animated series in all of children's television.\" He added, \"There is nothing that we have seen that points"
        ],
        "answer": "Spongebob first aired on May 1st, 1999, created by Stephen Hillenburg and produced by Nickelodeon Animation Studios.",
        "statements": "1.Spongebob first aired on May 1st, 1999.\n2.Spongebob was created by Stephen Hillenburg.\n3.Spongebob was produced by Nickelodeon Animation Studios.",
        "verification": "1. spongebob first aired on may 1st, 1999.\nexplanation: the context states that the series is celebrating its twentieth anniversary, which implies that it first aired in 1999. so answer is yes.\n2. spongebob was created by stephen hillenburg.\nexplanation: the context mentions stephen hillenburg as the creator of the series. so answer is yes.\n3. spongebob was produced by nickelodeon animation studios.\nexplanation: the context mentions nickelodeon animation studios as the producer of the series. so answer is yes.\nfinal answer: yes. yes. yes."
    },
    {
        "context": [
            "evidence that a bribe of US$52,000 was paid to change a zoning map, which enabled the opening of a Walmart store a mile from a historical site in San Juan Teotihuacán in 2004. After the initial article was released, Walmart released a statement denying the allegations and describing its anti-corruption policy. While an official Walmart report states that it had found no evidence of corruption, the article alleges that previous internal reports had indeed turned up such evidence before the story became public. Forbes magazine contributor Adam Hartung also commented that the bribery scandal was a reflection of Walmart's \"serious management and strategy troubles\", stating, \"[s]candals are now commonplace ... [e]ach scandal points out that Walmart's strategy is harder to navigate and is running into big problems\".In 2012, there was an incident with CJ's Seafood, a crawfish processing firm in Louisiana that was partnered with Walmart, that eventually gained media attention for the mistreatment of its 40 H-2B visa workers from Mexico. These workers experienced harsh living conditions in tightly packed trailers outside of the work facility, physical threats, verbal abuse, and were forced to work day-long shifts. Many of the workers were afraid to take action about the abuse due to the fact that the manager threatened the lives of their family members in the U.S. and Mexico if the abuse were to be reported. Eight of the workers confronted management at CJ's Seafood about the mistreatment; however, the management denied the abuse allegations and the workers went on strike. The workers then took their stories to Walmart due to their partnership with CJ's. While Walmart was investigating the situation, the workers collected 150,000 signatures of supporters who agreed that Walmart should stand by the workers and take action. In June 2012, the visa workers held a protest and day-long hunger strike outside of the apartment building where a Walmart board member resided. Following this protest, Walmart announced its final decision to no longer work with CJ's Seafood. Less than a month later, the Department of Labor fined CJ's Seafood \"approximately $460,000 in back-pay, safety violations, wage and hour violations, civil damages, and fines for abuses to the H-2B program. The company has since shut down.\"As of December 2012, internal investigations were ongoing into possible violations of the Foreign Corrupt Practices Act. Walmart has invested US$99 million on internal investigations, which expanded beyond Mexico to implicate operations in China, Brazil, and India. The case has added fuel to the debate as to whether foreign investment will result in increased prosperity, or if it merely allows local retail trade and economic policy to be taken over by \"foreign financial and corporate interests\".\n\n\n=== Sam's Club ===\n\nSam's Club is a chain of warehouse clubs that sell groceries and general merchandise, often in bulk. Locations generally range in size from 32,000–168,000 sq ft (3,000–15,600 m2), with an average club size of approximately 134,000 sq ft (12,400 m2). The first Sam's Club was opened by Walmart, Inc. in 1983 in Midwest City, Oklahoma under the name \"Sam's Wholesale Club\". The chain was named after its founder Sam Walton. As of October 31, 2022, Sam's Club operated 600 membership warehouse clubs and accounted for 11.3% of Walmart's revenue at $57.839 billion in fiscal year 2019. Kathryn McLay is the president and CEO of Sam's Club.\n\n\n=== Global eCommerce ===\nBased in San Bruno, California, Walmart's Global eCommerce division provides online retailing for Walmart, Sam's Club, Asda, and all other international brands. There are several locations in the United States in California and Oregon: San Bruno, Sunnyvale, Brisbane, and Portland. Locations outside of the United States include Shanghai (China), Leeds (United Kingdom), and Bangalore (India).\n\n\n== Subsidiaries ==\n\n\n=== Private label brands ===\n\nAbout 40 percent of products sold in Walmart are private labels, which are produced for the company through contracts with manufacturers. Walmart began offering private label brands in 1991, with the launch",
            "with subscription service Kidbox was announced on April 16, 2019.\n\n\n== Corporate affairs ==\n\nWalmart is headquartered in the Walmart Home Office complex in Bentonville, Arkansas. The company's business model is based on selling a wide variety of general merchandise at low prices. Doug McMillon became Walmart's CEO on February 1, 2014. He has also worked as the head of Sam's Club and Walmart International. The company refers to its employees as \"associates\". All Walmart stores in the U.S. and Canada also have designated \"greeters\" at the entrance, a practice pioneered by Sam Walton and later imitated by other retailers. Greeters are trained to help shoppers find what they want and answer their questions.For many years, associates were identified in the store by their signature blue vest, but this practice was discontinued in June 2007 and replaced with khaki pants and polo shirts. The wardrobe change was part of a larger corporate overhaul to increase sales and rejuvenate the company's stock price. In September 2014, the uniform was again updated to bring back a vest (paid for by the company) for store employees over the same polos and khaki or black pants paid for by the employee. The vest is navy blue for Walmart employees at Supercenters and discounts stores, lime green for Walmart Neighborhood Market employees, and yellow for self-check-out associates; door greeters, and customer service managers. All three state \"Proud Walmart Associate\" on the left breast and the \"Spark\" logo covering the back. Reportedly one of the main reasons the vest was reintroduced was that some customers had trouble identifying employees. In 2016, self-checkout associates, door greeters and customer service managers began wearing a yellow vest to be better seen by customers. By requiring employees to wear uniforms that are made up of standard \"streetwear\", Walmart is not required to purchase the uniforms or reimburse employees which are required in some states, as long as that clothing can be worn elsewhere. Businesses are only legally required to pay for branded shirts and pants or clothes that would be difficult to wear outside of work.Unlike many other retailers, Walmart does not charge slotting fees to suppliers for their products to appear in the store. Instead, it focuses on selling more-popular products and provides incentives for store managers to drop unpopular products.From 2006 to 2010, the company eliminated its layaway program. In 2011, the company revived its layaway program.Walmart introduced its Site-To-Store program in 2007, after testing the program since 2004 on a limited basis. The program allows walmart.com customers to buy goods online with a free shipping option, and have goods shipped to the nearest store for pickup.On September 15, 2017, Walmart announced that it would build a new headquarters in Bentonville to replace its current 1971 building and consolidate operations that have spread out to 20 different buildings throughout Bentonville.According to watchdog group Documented, in 2020 Walmart contributed $140,000 to the Rule of Law Defense Fund, a fund-raising arm of the Republican Attorneys General Association.\n\n\n=== Finance and governance ===\nFor the fiscal year ending January 31, 2019, Walmart reported net income of US$6.67 billion on $514.405 billion of revenue. The company's international operations accounted for $120.824 billion, or 23.7 percent, of its $510.329 billion of sales. Walmart is the world's 29th-largest public corporation, according to the Forbes Global 2000 list, and the largest public corporation when ranked by revenue.Walmart is governed by an eleven-member board of directors elected annually by shareholders. Gregory B. Penner, son-in-law of S. Robson Walton and the grandson-in-law of Sam Walton, serves as chairman of the board. Doug McMillon serves as president and chief executive officer. Current members of the board are:\nGregory B. Penner, chairman of the board of directors of Walmart Inc. and general partner of Madrone Capital Partners\nCesar Conde, chairman of NBCUniversal International Group and NBCUniversal Telemundo Enterprises\nTimothy P. Flynn, retired CEO of"
        ],
        "answer": "Walmart is a multinational retail corporation that was founded in 1962 by Sam Walton and is headquartered in Bentonville, Arkansas. It is the world's largest company by revenue, with over $500 billion in annual revenue. Walmart operates a chain of discount department stores, grocery stores, and hypermarkets.",
        "statements": "1.Walmart is a multinational retail corporation.\n2.Walmart was founded in 1962 by Sam Walton.\n3.Walmart is headquartered in Bentonville, Arkansas.\n4.Walmart is the world's largest company by revenue.\n5.Walmart operates a chain of discount department stores, grocery stores, and hypermarkets.",
        "verification": "1. walmart is a multinational retail corporation.\nexplanation: the context states that walmart is a retail corporation with operations in the united states, china, united kingdom, and india. so answer is yes.\n2. walmart was founded in 1962 by sam walton.\nexplanation: the context states that walmart was founded by sam walton in 1983. so answer is no.\n3. walmart is headquartered in bentonville, arkansas.\nexplanation: the context states that walmart is headquartered in the walmart home office complex in bentonville, arkansas. so answer is yes.\n4. walmart is the world's largest company by revenue.\nexplanation: the context states that walmart is the world's 29th-largest public corporation, according to the forbes global 2000 list. so answer is no.\n5. walmart operates a chain of discount department stores, grocery stores, and hypermarkets.\nexplanation: the context states that walmart operates a chain of warehouse clubs that sell groceries and general merchandise, often in bulk. so answer is yes.\nfinal answer: yes. no. yes. no. yes."
    },
    {
        "context": [
            "The Qing dynasty (English:  CHING), officially the Great Qing, was a Manchu-led imperial dynasty of China (1636–1912) and the last imperial dynasty in Chinese history. It emerged from the Later Jin dynasty founded by the Jianzhou Jurchens, a Tungusic-speaking ethnic group who unified other Jurchen tribes to form a new \"Manchu\" ethnic identity. The dynasty was officially proclaimed in 1636 in Manchuria (modern-day Northeast China and Outer Manchuria). It seized control of Beijing in 1644, then later expanded its rule over the whole of China proper and Taiwan, and finally expanded into Inner Asia. The dynasty lasted until 1912 when it was overthrown in the Xinhai Revolution. In Chinese historiography, the Qing dynasty was preceded by the Ming dynasty and succeeded by the Republic of China. The multiethnic Qing dynasty lasted for almost three centuries and assembled the territorial base for modern China. It was the largest imperial dynasty in the history of China and in 1790 the fourth-largest empire in world history in terms of territorial size. With 419,264,000 citizens in 1907, it was the most populous country in the world at the time.\nIn the late sixteenth century, Nurhaci, leader of the House of Aisin-Gioro, began organizing \"Banners\", which were military-social units that included Manchu, Han, and Mongol elements. Nurhaci united clans to create a Manchu ethnic identity and officially founded the Later Jin dynasty in 1616. His son Hong Taiji renamed the dynasty \"Great Qing\" and elevated the realm to an empire in 1636. As Ming control disintegrated, peasant rebels conquered Beijing in 1644, but the Ming general Wu Sangui opened the Shanhai Pass to the armies of the regent Prince Dorgon, who defeated the rebels, seized the capital, and took over the government. Resistance from Ming loyalists in the south and the Revolt of the Three Feudatories delayed the complete conquest until 1683. The Kangxi Emperor (1661–1722) consolidated control, maintained the Manchu identity, patronized Tibetan Buddhism, and relished the role of a Confucian ruler. Han officials worked under or in parallel with Manchu officials. The dynasty also adapted the ideals of the tributary system in asserting superiority over peripheral countries such as Korea and Vietnam, while extending control over Tibet, Mongolia, and Xinjiang.\nThe height of Qing glory and power was reached in the reign of the Qianlong Emperor (1735–1796). He led Ten Great Campaigns that extended Qing control into Inner Asia and personally supervised Confucian cultural projects. After his death, the dynasty faced changes in the world system, foreign intrusion, internal revolts, population growth, economic disruption, official corruption, and the reluctance of Confucian elites to change their mindsets. With peace and prosperity, the population rose to some 400 million, but taxes and government revenues were fixed at a low rate, soon leading to fiscal crisis. Following China's defeat in the Opium Wars, Western colonial powers forced the Qing government to sign \"unequal treaties\", granting them trading privileges, extraterritoriality and treaty ports under their control. The Taiping Rebellion (1850–1864) and the Dungan Revolt (1862–1877) in Central Asia led to the deaths of over 20 million people, from famine, disease, and war. The Tongzhi Restoration in the 1860s brought vigorous reforms and the introduction of foreign military technology in the Self-Strengthening Movement. Defeat in the First Sino-Japanese War in 1895 led to loss of suzerainty over Korea and cession of Taiwan to Japan. The ambitious Hundred Days' Reform of 1898 proposed fundamental change, but the Empress Dowager Cixi (1835–1908), who had been the dominant voice in the national government for more than three decades, turned it back",
            "arranged marriage, opium smoking, footbinding, judicial torture, and the worship of idols were all banned. However, success led to internal feuds, defections and corruption. In addition, British and French troops, equipped with modern weapons, had come to the assistance of the Qing imperial army. It was not until 1864 that Qing armies under Zeng Guofan succeeded in crushing the revolt. After the outbreak of this rebellion, there were also revolts by the Muslims and Miao people of China against the Qing dynasty, most notably in the Miao Rebellion (1854–1873) in Guizhou, the Panthay Rebellion (1856–1873) in Yunnan and the Dungan Revolt (1862–77) in the northwest.\n\nThe Western powers, largely unsatisfied with the Treaty of Nanjing, gave grudging support to the Qing government during the Taiping and Nian Rebellions. China's income fell sharply during the wars as vast areas of farmland were destroyed, millions of lives were lost, and countless armies were raised and equipped to fight the rebels. In 1854, Britain tried to re-negotiate the Treaty of Nanjing, inserting clauses allowing British commercial access to Chinese rivers and the creation of a permanent British embassy at Beijing.\n\nIn 1856, Qing authorities, in searching for a pirate, boarded a ship, the Arrow, which the British claimed had been flying the British flag, an incident which led to the Second Opium War. In 1858, facing no other options, the Xianfeng Emperor agreed to the Treaty of Tientsin, which contained clauses deeply insulting to the Chinese, such as a demand that all official Chinese documents be written in English and a proviso granting British warships unlimited access to all navigable Chinese rivers.\nRatification of the treaty in the following year led to a resumption of hostilities. In 1860, with Anglo-French forces marching on Beijing, the emperor and his court fled the capital for the imperial hunting lodge at Rehe. Once in Beijing, the Anglo-French forces looted and burned the Old Summer Palace and, in an act of revenge for the arrest, torture, and execution of the English diplomatic mission. Prince Gong, a younger half-brother of the emperor, who had been left as his brother's proxy in the capital, was forced to sign the Convention of Beijing. The humiliated emperor died the following year at Rehe.\n\n\n=== Self-strengthening and the frustration of reforms ===\nYet the dynasty rallied. Chinese generals and officials such as Zuo Zongtang led the suppression of rebellions and stood behind the Manchus. When the Tongzhi Emperor came to the throne at the age of five in 1861, these officials rallied around him in what was called the Tongzhi Restoration. Their aim was to adopt Western military technology in order to preserve Confucian values. Zeng Guofan, in alliance with Prince Gong, sponsored the rise of younger officials such as Li Hongzhang, who put the dynasty back on its feet financially and instituted the Self-Strengthening Movement. The reformers then proceeded with institutional reforms, including China's first unified ministry of foreign affairs, the Zongli Yamen; allowing foreign diplomats to reside in the capital; establishment of the Imperial Maritime Customs Service; the formation of modernized armies, such as the Beiyang Army, as well as a navy; and the purchase from Europeans of armament factories.The dynasty lost control of peripheral territories bit by bit. In return for promises of support against the British and the French, the Russian Empire took large chunks of territory in the Northeast in 1860. The period of cooperation between the reformers and the European powers ended with the Tientsin Massacre of 1870, which was incited by the murder of French nuns set off by the belligerence of local French diplomats. Starting with the Cochinchina Campaign in 1858, France expanded control of Indochina. By 1883, France was in full control of the region"
        ],
        "answer": "The Qing Dynasty began in 1644, under the rule of Emperor Kangxi, and ended in 1912, during the reign of Emperor Puyi.",
        "statements": "1.The Qing Dynasty began in 1644.\n2.The Qing Dynasty ended in 1912.",
        "verification": "1.the qing dynasty began in 1644.\nexplanation: the context states that the qing dynasty was officially proclaimed in 1636 in manchuria and seized control of beijing in 1644. so answer is yes.\n2.the qing dynasty ended in 1912.\nexplanation: the context states that the qing dynasty was overthrown in the xinhai revolution in 1912. so answer is yes.\nfinal answer: yes. yes."
    },
    {
        "context": [
            "Monument sometimes stalled for years; it would ultimately take over three-and-a-half decades to complete. There was criticism both of Bartholdi's statue and of the fact that the gift required Americans to foot the bill for the pedestal. In the years following the Civil War, most Americans preferred realistic artworks depicting heroes and events from the nation's history, rather than allegorical works like the Liberty statue. There was also a feeling that Americans should design American public works—the selection of Italian-born Constantino Brumidi to decorate the Capitol had provoked intense criticism, even though he was a naturalized U.S. citizen. Harper's Weekly declared its wish that \"M. Bartholdi and our French cousins had 'gone the whole figure' while they were about it, and given us statue and pedestal at once.\" The New York Times stated that \"no true patriot can countenance any such expenditures for bronze females in the present state of our finances.\" Faced with these criticisms, the American committees took little action for several years.\n\n\n==== Design ====\n\nThe foundation of Bartholdi's statue was to be laid inside Fort Wood, a disused army base on Bedloe's Island constructed between 1807 and 1811. Since 1823, it had rarely been used, though during the Civil War, it had served as a recruiting station. The fortifications of the structure were in the shape of an eleven-point star. The statue's foundation and pedestal were aligned so that it would face southeast, greeting ships entering the harbor from the Atlantic Ocean.\nIn 1881, the New York committee commissioned Richard Morris Hunt to design the pedestal. Within months, Hunt submitted a detailed plan, indicating that he expected construction to take about nine months. He proposed a pedestal 114 feet (35 m) in height; faced with money problems, the committee reduced that to 89 feet (27 m).Hunt's pedestal design contains elements of classical architecture, including Doric portals, as well as some elements influenced by Aztec architecture. The large mass is fragmented with architectural detail, in order to focus attention on the statue. In form, it is a truncated pyramid, 62 feet (19 m) square at the base and 39.4 feet (12.0 m) at the top. The four sides are identical in appearance. Above the door on each side, there are ten disks upon which Bartholdi proposed to place the coats of arms of the states (between 1876 and 1889, there were 38 of them), although this was not done. Above that, a balcony was placed on each side, framed by pillars. Bartholdi placed an observation platform near the top of the pedestal, above which the statue itself rises. According to author Louis Auchincloss, the pedestal \"craggily evokes the power of an ancient Europe over which rises the dominating figure of the Statue of Liberty\". The committee hired former army General Charles Pomeroy Stone to oversee the construction work. Construction on the 15-foot-deep (4.6 m) foundation began in 1883, and the pedestal's cornerstone was laid in 1884. In Hunt's original conception, the pedestal was to have been made of solid granite. Financial concerns again forced him to revise his plans; the final design called for poured concrete walls, up to 20 feet (6.1 m) thick, faced with granite blocks. This Stony Creek granite came from the Beattie Quarry in Branford, Connecticut. The concrete mass was the largest poured to that time.Norwegian immigrant civil engineer Joachim Goschen Giæver designed the structural framework for the Statue of Liberty. His work involved design computations, detailed fabrication and construction drawings, and oversight of construction. In completing his engineering for the statue's frame, Giæver worked from drawings and sketches produced by Gustave Eiffel.\n\n\n==== Fundraising ====\nFundraising in the US for the pedestal had begun in 1882. The committee organized a large number of money-raising events. As part of one such effort, an auction of art and manuscripts, poet Emma",
            "fact that vessels arriving in New York had to sail past it. He was delighted to learn that the island was owned by the United States government—it had been ceded by the New York State Legislature in 1800 for harbor defense. It was thus, as he put it in a letter to Laboulaye: \"land common to all the states.\" As well as meeting many influential New Yorkers, Bartholdi visited President Ulysses S. Grant, who assured him that it would not be difficult to obtain the site for the statue. Bartholdi crossed the United States twice by rail, and met many Americans who he thought would be sympathetic to the project. But he remained concerned that popular opinion on both sides of the Atlantic was insufficiently supportive of the proposal, and he and Laboulaye decided to wait before mounting a public campaign.\n\nBartholdi had made a first model of his concept in 1870. The son of a friend of Bartholdi's, artist John LaFarge, later maintained that Bartholdi made the first sketches for the statue during his visit to La Farge's Rhode Island studio. Bartholdi continued to develop the concept following his return to France. He also worked on a number of sculptures designed to bolster French patriotism after the defeat by the Prussians. One of these was the Lion of Belfort, a monumental sculpture carved in sandstone below the fortress of Belfort, which during the war had resisted a Prussian siege for over three months. The defiant lion, 73 feet (22 m) long and half that in height, displays an emotional quality characteristic of Romanticism, which Bartholdi would later bring to the Statue of Liberty.\n\n\n=== Design, style, and symbolism ===\n\nBartholdi and Laboulaye considered how best to express the idea of American liberty. In early American history, two female figures were frequently used as cultural symbols of the nation. One of these symbols, the personified Columbia, was seen as an embodiment of the United States in the manner that Britannia was identified with the United Kingdom, and Marianne came to represent France. Columbia had supplanted the traditional European Personification of the Americas as an \"Indian princess\", which had come to be regarded as uncivilized and derogatory toward Americans. The other significant female icon in American culture was a representation of Liberty, derived from Libertas, the goddess of freedom widely worshipped in ancient Rome, especially among emancipated slaves. A Liberty figure adorned most American coins of the time, and representations of Liberty appeared in popular and civic art, including Thomas Crawford's Statue of Freedom (1863) atop the dome of the United States Capitol Building.The statue's design evokes iconography evident in ancient history including the Egyptian goddess Isis, the ancient Greek deity of the same name, the Roman Columbia and the Christian iconography of the Virgin Mary.\n \nArtists of the 18th and 19th centuries striving to evoke republican ideals commonly used representations of Libertas as an allegorical symbol. A figure of Liberty was also depicted on the Great Seal of France. However, Bartholdi and Laboulaye avoided an image of revolutionary liberty such as that depicted in Eugène Delacroix's famed Liberty Leading the People (1830). In this painting, which commemorates France's July Revolution, a half-clothed Liberty leads an armed mob over the bodies of the fallen. Laboulaye had no sympathy for revolution, and so Bartholdi's figure would be fully dressed in flowing robes. Instead of the impression of violence in the Delacroix work, Bartholdi wished to give the statue a peaceful appearance and chose a torch, representing progress, for the figure to hold. Its second toe on both feet is longer than its big toe, a condition known as Morton's toe or 'Greek foot'. This was an aesthetic staple of ancient Greek art and reflects the classical influences on the statue.Crawford's statue was designed in the early 1850s. It was originally to be crowned with a pileus, the cap given"
        ],
        "answer": "The Statue of Liberty was designed by French sculptor Frédéric Auguste Bartholdi in 1875 and was completed in 1883. It was a gift from the people of France to the United States to celebrate the 100th anniversary of the signing of the Declaration of Independence in 1776.",
        "statements": "1.The Statue of Liberty was designed by French sculptor Frédéric Auguste Bartholdi.\n2.The Statue of Liberty was a gift from the people of France to the United States.",
        "verification": "1.the statue of liberty was designed by french sculptor frédéric auguste bartholdi.\nexplanation: the context states that the statue of liberty was designed by french sculptor frédéric auguste bartholdi. so answer is yes.\n2.the statue of liberty was a gift from the people of france to the united states.\nexplanation: the context states that the statue of liberty was a gift from the people of france to the united states. so answer is yes.\nfinal answer: yes. yes."
    },
    {
        "context": [
            "v. Kitzhaber (Oregon). On May 19, 2014, district judge Michael J. McShane declares Oregon's same-sex marriage ban unconstitutional.\nBostic v. Schaefer (Virginia). The Fourth Circuit on July 28, 2014, in a 2–1 decision, affirms a district court ruling that Virginia's denial of marriage rights to same-sex couples is unconstitutional. The Supreme Court denied review on October 6.\nBaskin v. Bogan (Indiana) and Wolf v. Walker (Wisconsin). The Seventh Circuit consolidated these cases and on September 4, 2014, upheld two district court rulings that had found Indiana's and Wisconsin's bans on same-sex marriage unconstitutional. The U.S. Supreme Court denied review on October 6.\nBishop v. Smith (Oklahoma). On July 18, 2014, the Tenth Circuit upholds the district court ruling that Oklahoma's ban on same-sex marriage is unconstitutional. The Supreme Court denied review on October 6.\nBarrier v. Vasterling (Missouri). State circuit judge J. Dale Youngs rules on October 3, 2014, that Missouri's refusal to recognize same-sex marriages from other jurisdictions violates the plaintiff same-sex couples' right to equal protection under both the state and federal constitutions.\nCaspar v. Snyder (Michigan). On January 15, 2015, U.S. district judge Mark A. Goldsmith ruled that the state must recognize the validity of \"window marriages\" established on March 21 and 22, 2014, before the Sixth Circuit Court of Appeals stayed a district court ruling in DeBoer v. Snyder that found Michigan's ban on same-sex marriage unconstitutional, despite the fact that DeBoer was later reversed. The state chose not to appeal.\nObergefell v. Hodges (2013-2015). U.S. Supreme Court case finding state bans on same-sex marriage to be unconstitutional under the 14th Amendment. (Overturned Baker v. Nelson)\n\n\n== Public opinion ==\n\nAmericans began to be polled occasionally on the topic in the 1980s and more regularly in the 1990s. From 1988 to 2009, support for same-sex marriage increased between 1% and 1.5% per year. In the 2010s, it increased more quickly.Gallup found that nationwide public support reached 50% in May 2011, 60% in May 2015, and 70% in May 2021.The Pew Research Center similarly found 40% in 2010, 50% in 2013 and 61% in 2019.As of 2016, 83% of Americans aged 18–29 supported same-sex marriage.As of 2021, there is majority support for same-sex marriage in 47 states, ranging from 50% in South Carolina to 85% in Massachusetts. There is plurality support in Alabama, with 49% supporting and 47% opposing. Only Mississippi and Arkansas have majority opposition to same-sex marriage; in Mississippi, 55% oppose and 44% support, while in Arkansas, 52% oppose and 47% support same-sex marriage.As of 2018, 60% of Americans said they would not mind if their child married someone of the same gender.Annual polling conducted by Gallup each May in 2017, 2018, 2019 and 2020 has found support for same-sex marriage stable, with two-thirds of Americans indicating that same-sex marriage should be recognized as valid under law (a range of 63% to 67% was recorded). In 2022, a new record high of 71% of respondents stated that same-sex marriage should be legally recognized as valid under the law.A Grinnell College National Poll in September 2022 indicated that 74% of Americans thought that same-sex marriage should be a guaranteed right, 13% thought it should be left to elected officials, and 13% were unsure.\n\n\n== See also ==\nDivorce of same-sex couples\nHistory of same-sex marriage in the United States\nLGBT employment discrimination in the United States\nLGBT rights in the United States\nRecognition of same-sex unions in the Americas\nSame-sex unions and military policy#United States\nStatus of same-sex marriage\nTimeline of same-sex marriage in the United States\nTimeline of same-sex marriage\n\n\n=== Legislation ===\nDomestic partnership in the United States\nFederal Marriage Amendment\nRespect for Marriage Act\nFormer",
            "are licensed in and recognized by all U.S. states and the District of Columbia, as well as all U.S. territories except American Samoa. However, under the Respect for Marriage Act, American Samoa must recognize all marriages between two people that were legally performed in another jurisdiction.  \nOn January 6, 2016, Alabama's Chief Justice, Roy Moore, issued a ruling forbidding state officials from issuing marriage licenses to same-sex couples. The ruling had no effect as all Alabama counties continued either issuing marriage licenses to all couples or not issuing licenses at all. In May 2016, Moore was charged with ethics violations by the state Judicial Inquiry Commission for the ruling, subsequently being suspended from the bench for the remainder of his term on September 30 of that year.\n\n\n==== Counties not issuing marriage licenses ====\nAs of 2020, there are apparently no counties in the United States that do not (or would not) register the marriages of same-sex couple. \n\nOfficials of one Texas county, Irion, issued marriage licenses, but claimed they would refuse same-sex couples. Starting in 2017, they refused to comment on what they would do if a same-sex couple were to apply for license. However, as of March 2020, the Irion County clerk stated she would issue marriage licenses to same-sex couples and the form available on the office's website was not gender specific and stated no restrictions as to the genders of the applicants.\nOfficials in several Alabama counties initially stopped issuing any marriage licenses rather than issue them to same-sex couples. By 2017, the number of counties doing this to avoid issuing them to same-sex couples dropped to eight. This was in accordance with a state law, which was passed in 1961 to preserve racial segregation by making it optional for county clerks to issue marriage licenses. The Alabama Legislature passed a bill replacing marriage licenses with marriage certificates in May 2019. These final eight counties resumed allowing couples to marry on August 29, 2019.\nSeveral Kentucky counties initially refused to marry same-sex couples. In response, Kentucky reformed its marriage license forms and removed the name of the county clerk from the licenses. As of June 2016, Chris Hartmann, director of the Kentucky-based Fairness Campaign, said that to his knowledge \"there are no counties where marriage licenses are being denied\" in his state.\n\n\n==== Parental rights ====\n\nPost-Obergefell, six states have, on occasion, attempted to deny same-sex couples full adoption rights to varying degrees. In Arkansas, Florida, Indiana, and Wisconsin, same-sex couples have been met with rejection when trying to get both parents' names listed on the birth certificate. In V.L. v. E.L., Alabama's highest court attempted to void an adoption decree obtained by a same-sex couple in Georgia, but the U.S. Supreme Court reversed, restoring joint custody to the adoptive mother on March 7, 2016. Mississippi had once banned same-sex couples from adopting, but the law requiring this was ruled unconstitutional by the United States District Court for the Southern District of Mississippi on March 31, 2016. With that ruling, adoption by same-sex couples became legal in all fifty states.On June 26, 2017, the Supreme Court ruled by a 6–3 vote in the case of Pavan v. Smith that under their decision in Obergefell, same-sex couples must be treated equally to opposite-sex couples in the issuance of birth certificates. In December 2016, the Supreme Court of Arkansas upheld a state law only allowing opposite-sex couples to be automatically listed as parents on their children's birth certificates, while prohibiting same-sex couples from being allowed the same on an equal basis. The Supreme Court summarily reversed the Arkansas Supreme Court, finding that the disparity in treatment violated their decision in Obergefell.\n\n\n=== Tribal law ===\n\nThe Supreme Court decision legalizing same-sex marriage in the states and territories did not legalize same-sex marriage in Native American"
        ],
        "answer": "\nAll states and territories in the United States allow same-sex marriage. This includes the 50 states, the District of Columbia, and all U.S. territories except American Samoa. American Samoa must recognize all marriages between two people that were legally performed in another jurisdiction under the Respect for Marriage Act.",
        "statements": "1.Same-sex marriage is legal in all states and territories in the United States.\n2.American Samoa must recognize all marriages between two people that were legally performed in another jurisdiction.",
        "verification": "1. same-sex marriage is legal in all states and territories in the united states.\nexplanation: the context states that same-sex marriage is licensed in and recognized by all u.s. states and the district of columbia, as well as all u.s. territories except american samoa. so answer is yes.\n2. american samoa must recognize all marriages between two people that were legally performed in another jurisdiction.\nexplanation: the context states that under the respect for marriage act, american samoa must recognize all marriages between two people that were legally performed in another jurisdiction. so answer is yes.\nfinal answer: yes. yes."
    }
]